JamesHarman0020/ECE4191-Team-13-PSoC/PSoC5_Team13Project.cydsn/Generated_Source/PSoC5/BrakeCounterTrig.h
/*******************************************************************************
* File Name: BrakeCounterTrig.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_BrakeCounterTrig_H) /* CY_CONTROL_REG_BrakeCounterTrig_H */
#define CY_CONTROL_REG_BrakeCounterTrig_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} BrakeCounterTrig_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    BrakeCounterTrig_Write(uint8 control) ;
uint8   BrakeCounterTrig_Read(void) ;

void BrakeCounterTrig_SaveConfig(void) ;
void BrakeCounterTrig_RestoreConfig(void) ;
void BrakeCounterTrig_Sleep(void) ; 
void BrakeCounterTrig_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define BrakeCounterTrig_Control        (* (reg8 *) BrakeCounterTrig_Sync_ctrl_reg__CONTROL_REG )
#define BrakeCounterTrig_Control_PTR    (  (reg8 *) BrakeCounterTrig_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_BrakeCounterTrig_H */


/* [] END OF FILE */
